{
  "sessions": [
    {
      "Id" : 1,
      "dayId": 1,
      "roomId": [0,0],
      "slotImg" :"../src/img/icon_droid.png",
      "speakerIDs": [[],[]],
      "sessionDate": "2015-12-04 08:00",
      "sessionDisplayHour": "8:00",
      "sessionTitle": ["Registration Opens", ""],
      "sessionDescription": ["", ""]
    },
    {
      "Id" : 2,
      "dayId": 1,
      "roomId": [1,1],
      "slotImg" :"../src/img/icon_droid.png",
      "speakerIDs": [[],[]],
      "sessionDate": "2015-12-04 09:00",
      "sessionDisplayHour": "9:00 - 9:15",
      "sessionTitle": ["Opening", ""],
      "sessionDescription": ["", ""]
    },
    {
      "Id" : 3,
      "dayId": 1,
      "roomId": [1,2],
      "slotImg" :"",
      "speakerIDs": [[],[]],
      "sessionDate": "2015-12-04 09:15",
      "sessionDisplayHour": "9:15 - 10:00",
      "sessionTitle": ["TBA", "TBA"],
      "sessionDescription": ["", ""]
    },
    {
      "Id" : 4,
      "dayId": 1,
      "roomId": [1,2],
      "slotImg" :"",
      "speakerIDs": [[6],[2]],
      "sessionDate": "2015-12-04 10:10",
      "sessionDisplayHour": "10:10 - 10:55",
      "sessionTitle": ["Managing Runtime Permissions", "The 2015 Android Developer Toolbox"],
      "sessionDescription": ["## Summary<br /><br />I'm gonna talk about what actually the changing of Runtime Permissions is and how to manage it well, with my library \"PermissionsDispatcher\" which solves the problem that writing a ton of boiler plate codes.<br />https://github.com/hotchemi/PermissionsDispatcher<br /><br />## Detail<br /><br />In the last GoogleIO 2015, google released the new feature of Marshmallow which is called \"Runtime Permissions\". It drastically changed the way to handle permissions from the previous mechanism.<br /><br />The change is basically great for users but also the hell for developers. Because developers have to write a ton of boilerplate codes and the new mechanism and api may not be easy for developers.<br /><br />### For example<br />- `shouldShowRationale` is a really confusing method<br />- There is a lot of class which have methods about permissions, PermissionChecker, ContextCompat, ActivityCompat, FragmentCompat, etc...<br /><br />So in this session, I'm gonna talk about what actually the change is and how to manage permissions well. And I'm also gonna introduce the usage of my library \"PermissionsDispatcher\", which solves the problem that writing a ton of boilerplate codes.<br /><br />https://github.com/hotchemi/PermissionsDispatcher", "Developing for Android has drastically changed over the last few years.<br />We now have a gigantic toolbox we can benefit from to improve our productivity and build better applications.<br /><br />During this presentation I will introduce some of the tools we use daily at happn, a multi-million users French dating application.<br /><br />I will talk about many tools that help us to:<br />- Simulate a laggy/instable HTTP(s) connection<br />- Interact with our application to analyze logs, views, and modify any data (inc. memory / shared preferences / database) in real time<br />- Change our application's backend server without recompiling<br />- Better understand our technical debt<br />- Create a REST mock server in a few seconds to anticipate the development of a feature when the backend is not developed yet<br />- Measure the performance (cpu/memory) of our application<br />- Decompile our application to better understand and analyze its security<br />- Alter a server response and check whether the application behaves properly<br />- and many more tips..."]
    },
    {
      "Id" : 5,
      "dayId": 1,
      "roomId": [0,0],
      "slotImg" :"../src/img/icon_coffee.png",
      "speakerIDs": [[],[]],
      "sessionDate": "2015-12-04 10:55",
      "sessionDisplayHour": "10:55 - 11:15",
      "sessionTitle": ["Coffee break", ""],
      "sessionDescription": ["", ""]
    },
    {
      "Id" : 6,
      "dayId": 1,
      "roomId": [1,2],
      "slotImg" :"",
      "speakerIDs": [[4],[]],
      "sessionDate": "2015-12-04 11:15",
      "sessionDisplayHour": "11:15 - 12:00",
      "sessionTitle": ["Material Design Custom Views", "TBA"],
      "sessionDescription": ["There are various widgets to create user interfaces in Android Framework. Using these widgets is a starting point but they are not enough to create awesome apps. Fortunately, alternative methods are here to rescue! I mean understanding and extending the View class.<br /><br />In this presentation, I will give some Custom View examples. Some of them makes impossible things be possible and some of them increase performance.<br /><br />I will talk about how to apply Material Design principles in Custom Views while supporting the older platform versions.<br /><br />If you want to be beyond the limits of ordinary, open to innovation and surprise your users, this talk is for you.", ""]
    },
    {
      "Id" : 7,
      "dayId": 1,
      "roomId": [1,2],
      "slotImg" :"",
      "speakerIDs": [[19],[13]],
      "sessionDate": "2015-12-04 12:10",
      "sessionDisplayHour": "12:10 - 12:40",
      "sessionTitle": ["How to live with Doze and App Standby", "Power of Android Shell"],
      "sessionDescription": ["Doze and App Standby can break your heart by moving your application to an idle state, making it almost impossible to perform any meaningful background processing. But hey, they are not your enemies after all. Attend this talk to learn how to make friends with Marshmallow's peace janitors.", "Android provides a set of not really well documented command line tools that are mainly used by system engineers for debugging and testing purposes. Available after entering 'adb shell', these tools can give you a lot of details about what is happening in the system and help with automation. <br /><br />We'll see what is available in Android command line and:<br /><br />- analyze system and sample apps with 'dumpsys', <br /><br />- find out how to check whether your service finishes normally and does not live forever, <br /><br />- mock battery level and charger state, <br /><br />- trigger account sychronization, <br /><br />- change system settings without a single line of UiAutomator code."]
    },
    {
      "Id" : 8,
      "dayId": 1,
      "roomId": [0,0],
      "slotImg" :"../src/img/icon_fork.png",
      "speakerIDs": [[],[]],
      "sessionDate": "2015-12-04 12:40",
      "sessionDisplayHour": "12:40 - 14:00",
      "sessionTitle": ["Lunch break", ""],
      "sessionDescription": ["", ""]
    },
    {
      "Id" : 9,
      "dayId": 1,
      "roomId": [1,2],
      "slotImg" :"",
      "speakerIDs": [[10],[]],
      "sessionDate": "2015-12-04 14:00",
      "sessionDisplayHour": "14:00 - 14:30",
      "sessionTitle": ["Clean architecture: Android", "TBA"],
      "sessionDescription": ["Planning architecture of application is a complex task. Did you ever consider where to put business logic and how to organize it in a clean, re-usable way? How to make your project more readable and testable to reduce number of issues?  In this presentation  bill be explain how to use MVP/MVC, MVVM patterns and whole clean architecture concept for your Android app development.", ""]
    },
    {
      "Id" : 10,
      "dayId": 1,
      "roomId": [1,2],
      "slotImg" :"",
      "speakerIDs": [[17],[8]],
      "sessionDate": "2015-12-04 14:40",
      "sessionDisplayHour": "14:40 - 15:25",
      "sessionTitle": ["Deep dive into Android Data Binding", "Unit test via Spock"],
      "sessionDescription": ["During last Google IO conference Google presented Android Data Binding Library. I would like to show how to use it with Model-View-ViewModel (MVVM) design pattern.<br /><br />Data Binding Library is currently in beta but definitely it will become the new standard for Android developers, the sooner we start to learn it the better for us and our projects!<br /><br />In this talk I will explain how MVVM works, why we really need it and how  this design pattern can make UI code easier to read, test and maintain.", "My presentation shows how to create unit test via Spock framework.<br />Through my presentation I would like to encourage the use of this library and show that writing of unit tests can be fun and enjoyable and may affect the code quality."]
    },
    {
      "Id" : 11,
      "dayId": 1,
      "roomId": [0,0],
      "slotImg" :"../src/img/icon_coffee.png",
      "speakerIDs": [[],[]],
      "sessionDate": "2015-12-04 15:25",
      "sessionDisplayHour": "15:25 - 15:45",
      "sessionTitle": ["Coffee break", ""],
      "sessionDescription": ["", ""]
    },
    {
      "Id" : 12,
      "dayId": 1,
      "roomId": [1,2],
      "slotImg" :"",
      "speakerIDs": [[7],[18]],
      "sessionDate": "2015-12-04 15:45",
      "sessionDisplayHour": "15:45 - 16:30",
      "sessionTitle": ["I'm not trying to piss you off: why designers insist on costly features", "Code quality tips and best practices for Android"],
      "sessionDescription": ["I'm a UI designer. In my talk, I will discuss why we sometimes design features that are difficult and/or costly to implement. I will also suggest some methods of resolving such conflicts and strategies for optimising the scope so it meets needs and expectations. This talk will be beneficial to developers who implement UI and work with designers.", "Android apps are developed using JAVA, but not all Android developers are \"real\" JAVA developers (including myself). There are many rules and best practices to write clean code on JAVA, but how much do we care about those as Android developers?<br /><br />In this talk, I will discuss some code quality tips and best practices, which make most sense for Android code, with examples of bad and improved versions of code. Furthermore, I will recommend some popular source code analysis tools and explain how we brought them into our attention in our day-to-day development process."]
    },
    {
      "Id" : 13,
      "dayId": 1,
      "roomId": [1,2],
      "slotImg" :"",
      "speakerIDs": [[12],[]],
      "sessionDate": "2015-12-04 16:40",
      "sessionDisplayHour": "16:40 - 17:10",
      "sessionTitle": ["How to move faster from an idea to full-fledged app?", "TBA"],
      "sessionDescription": ["Probably you have dozens of ideas, and people always pitch you \"Oh, I have that milion dollar idea for app\". From my experience over past couple of years I will show you how to pick idea, team, validate it, release MVP, gain traction and hopefuly all this with 5 star rating. This presentation will be on the verge of marketing, business and app development - but told from point of view of a software developer.", ""]
    },
    {
      "Id" : 14,
      "dayId": 1,
      "roomId": [1,1],
      "slotImg" :"../src/img/icon_droid.png",
      "speakerIDs": [[],[]],
      "sessionDate": "2015-12-04 17:10",
      "sessionDisplayHour": "17:10 - 17:30",
      "sessionTitle": ["Closing Day 1", ""],
      "sessionDescription": ["", ""]
    },
    {
      "Id" : 15,
      "dayId": 1,
      "roomId": [0,0],
      "slotImg" :"../src/img/icon_party.png",
      "speakerIDs": [[],[]],
      "sessionDate": "2015-12-04 20:00",
      "sessionDisplayHour": "20:00",
      "sessionTitle": ["Afterparty", ""],
      "sessionDescription": ["", ""]
    },
    {
      "Id" : 16,
      "dayId": 2,
      "roomId": [1,1],
      "slotImg" :"../src/img/icon_droid.png",
      "speakerIDs": [[],[]],
      "sessionDate": "2015-12-05 08:00",
      "sessionDisplayHour": "9:45 - 10:00",
      "sessionTitle": ["Opening Day 2", ""],
      "sessionDescription": ["", ""]
    },
    {
      "Id" : 17,
      "dayId": 2,
      "roomId": [1,2],
      "slotImg" :"",
      "speakerIDs": [[],[15]],
      "sessionDate": "2015-12-05 10:00",
      "sessionDisplayHour": "10:00 - 10:30",
      "sessionTitle": ["TBA", "USING ANDROID TO CREATE THE BEST UX WITH #IOT"],
      "sessionDescription": ["", "In this presentation we will talk about daily use of IoT devices and the Android based operation system Brillo.<br /><br />We are in the early stages in the creation of Internet of Things. And the examples I will provide just a glimpse into what is possible when you combine sensors, actuators, and networked intelligence to create more fun and easy lifestyle.<br /><br />My previous experience about this presentation: https://www.youtube.com/watch?v=FXcBaqFiSmI"]
    },
    {
      "Id" : 18,
      "dayId": 2,
      "roomId": [1,2],
      "slotImg" :"",
      "speakerIDs": [[1],[16]],
      "sessionDate": "2015-12-05 10:40",
      "sessionDisplayHour": "10:40 - 11:25",
      "sessionTitle": ["Android Reactive Programming with RxJava", "Android Fingerprint API"],
      "sessionDescription": ["In a world where there is a smartphone in every pocket, designing and building applications that can run smoothly and deliver the User Experience that users will like, it’s the only way to go. Reactive Programming with RxJava will help you to beat Android Platform limitations to create astonishing Android Apps.<br /><br />This talk will be a practical journey from basic Reactive Programming and Observer Pattern concepts to the main feature of RxJava, with practical code examples and a real-world app.<br /><br />I'll show the audience how to create an Observable \"from scratch\", from a list or from a function we already have in our code base. Our listeners will learn how to filter an Observable sequence to create a new sequence containing only the values we want; they will learn how to apply a function to an Observable, how to concatenate, merge or zip Observables. I'll show how to enjoy RxAndroid Schedulers to overcome the threading and concurrency hell in Android.<br /><br />I will close the talk with a practical example about RxJava + Retrofit, to easily communicate with a REST API.", "Nobody likes typing in passwords, especially on mobile phones. <br /><br />Password Sucks!<br /><br />Android Marshmallow brings official support of fingerprint authentication to the Android platform. <br /><br />It's available for developers to integrate inside their own Android apps, accelerate payments and sign-in operations. <br /><br />During my talk we will learn on how can we secure sensitive users data, and how can we use this API to authenticate on remote servers. "]
    },
    {
      "Id" : 19,
      "dayId": 2,
      "roomId": [0,0],
      "slotImg" :"../src/img/icon_coffee.png",
      "speakerIDs": [[],[]],
      "sessionDate": "2015-12-05 11:25",
      "sessionDisplayHour": "11:25 - 11:45",
      "sessionTitle": ["Coffee break", ""],
      "sessionDescription": ["", ""]
    },
    {
      "Id" : 20,
      "dayId": 2,
      "roomId": [1,2],
      "slotImg" :"",
      "speakerIDs": [[5],[3]],
      "sessionDate": "2015-12-05 11:45",
      "sessionDisplayHour": "11:45 - 12:30",
      "sessionTitle": ["Kotlin in a real-world Android project", "Recipes in RxJava for Android"],
      "sessionDescription": ["Kotlin is the language that can bring the quality of your code to the next level. <br />Developed by JetBrains and highly appreciated by many Android developers, it is getting more and more popular.<br /><br />This talk will briefly introduce the language basics and show how real-world problems can be solved with Kotlin.", "You've heard of reactive programming and RxJava but aren't sure how to do some things? Worried about the Android lifecycle? Scared of multithreading? This talk will show you how to do all of this, easily (well, easiER than normal Java/Android) and lots more!<br /><br />For example, want to add a network API layer between your app and the network calls? Use a Subject. want to have quick and easy network caching? Just use BehaviourSubject which caches the last value. Don't want to stop and restart network calls because the app rotated? Make an Api Manager married to the Application context instead of the Activity context. <br /><br />It will also show how you can use multithreading that is almost painless, and - even more importantly - some of the common problems and bugs encountered while using RxJava multithreading."]
    },
    {
      "Id" : 21,
      "dayId": 2,
      "roomId": [1,2],
      "slotImg" :"",
      "speakerIDs": [[11],[]],
      "sessionDate": "2015-12-05 12:40",
      "sessionDisplayHour": "12:40 - 13:10",
      "sessionTitle": ["Protocols and communication in the IoT world", "TBA"],
      "sessionDescription": ["The Internet of Things is here to stay. It could be in your house, in your pocket, in your car, on your wrist or in your traveling suitcase. From smart phones and smart watches to smart beds and smart dishwashers, we are living in a world where everything is connectable to the Internet. However, to connect those things and make them smart we need new protocols and new ways of communication. In this presentation we’ll talk about IoT protocols like MQTT and CoAP and ways of communication with hardware - not just with WiFi and BT, but also with light and sound.", ""]
    },
    {
      "Id" : 22,
      "dayId": 2,
      "roomId": [0,0],
      "slotImg" :"../src/img/icon_fork.png",
      "speakerIDs": [[],[]],
      "sessionDate": "2015-12-05 13:10",
      "sessionDisplayHour": "13:10 - 14:30",
      "sessionTitle": ["Lunch break", ""],
      "sessionDescription": ["", ""]
    },
    {
      "Id" : 23,
      "dayId": 2,
      "roomId": [1,2],
      "slotImg" :"",
      "speakerIDs": [[14],[]],
      "sessionDate": "2015-12-05 14:30",
      "sessionDisplayHour": "14:30 - 15:00",
      "sessionTitle": ["Motion recognition and creating fitness apps for Android Wear", "TBA"],
      "sessionDescription": ["Wearable devices are being used more and more these days, because they allows to get almost any app just on your wrist. Now we have wearable apps to count your steps, track pulse and measure the distance to run, but nevertheless, fitness apps are still interesting area to discover. During the talk we will discover how to implement custom motions recognition, for example, counting the situps, pushups and jumpings, and use the battery in the efficient mode.", ""]
    },
    {
      "Id" : 24,
      "dayId": 2,
      "roomId": [1,1],
      "slotImg" :"",
      "speakerIDs": [[9],[]],
      "sessionDate": "2015-12-05 15:15",
      "sessionDisplayHour": "15:15 - 16:00",
      "sessionTitle": ["20 tips for building better apps", ""],
      "sessionDescription": ["tl;dr: learn from others' mistakes, don't repeat them.<br /><br />Anyone can start making Android apps, but with the platform evolving rapidly it's not easy to stay on top of what's required to maintain high quality. During this presentation you'll learn various API, tooling, performance and battery life tips and best practices that will make your life as a developer easier and help you build better apps for your users.", ""]
    },
    {
      "Id" : 25,
      "dayId": 2,
      "roomId": [0,0],
      "slotImg" :"../src/img/icon_coffee.png",
      "speakerIDs": [[],[]],
      "sessionDate": "2015-12-05 16:00",
      "sessionDisplayHour": "16:00 - 16:20",
      "sessionTitle": ["Coffee break", ""],
      "sessionDescription": ["", ""]
    },
    {
      "Id" : 26,
      "dayId": 2,
      "roomId": [1,2],
      "slotImg" :"",
      "speakerIDs": [[],[]],
      "sessionDate": "2015-12-05 16:20",
      "sessionDisplayHour": "16:20 - 18:00",
      "sessionTitle": ["Barcamp", "Barcamp"],
      "sessionDescription": ["", ""]
    },
    {
      "Id" : 27,
      "dayId": 2,
      "roomId": [1,1],
      "slotImg" :"../src/img/icon_droid.png",
      "speakerIDs": [[],[]],
      "sessionDate": "2015-12-05 18:00",
      "sessionDisplayHour": "18:00 - 18:30",
      "sessionTitle": ["Closing Day 2", ""],
      "sessionDescription": ["", ""]
    },
    {
      "Id" : 28,
      "dayId": 3,
      "roomId": [0,0],
      "slotImg" :"../src/img/icon_droid.png",
      "speakerIDs": [[],[]],
      "sessionDate": "2015-12-05 09:00",
      "sessionDisplayHour": "10:00 - 19:00",
      "sessionTitle": ["Hackathon", ""],
      "sessionDescription": ["The Agenda for the Hackathon will be announced soon!", ""]
    }
  ]
}
