{
    "people": [
        {
            "id": 1,
            "firstName": "Ivan",
            "lastName": "Morgillo",
            "websiteTitle": "Senior Android Developer",
            "bio": "I started playing with Android in late 2010 as an embedded engineer, then I moved to the \"Application layer\", publishing a few weekend projects.\n\nMy personal most popular Android app is Kindle Gratis, a Kindle companion app with almost 100k downloads. I like Open Source projects. I'm a big fan of a lot of fancy Android libraries out there and I contribute with bug reporting, fixing and feedbacks.\n\nI approached Reactive Programming in 2013 and I started using it in Android thanks to RxJava by Netflix. I'm using it in every Android app I work on since then, because RxJava solves so many issues on Android and it gives you a new perspective about mobile programming.\n\nIn 2013 I co-founded Alter Ego, a mobile and embedded solutions company. In 2015 I published RxJava Essentials for Packt Publishing. I'm currently writing Grokking Rx for Manning Publishing. ",
            "imageUrl": "src/img/people/ivan-morgillo.png",
            "sessions": [
                1,
                2,
                3
            ]
        },
        {
            "id": 2,
            "firstName": "Gautier",
            "lastName": "Mechling",
            "websiteTitle": "Android Software Craftsman",
            "bio": "Gautier is an aspiring Software Craftsman at happn in Paris, France.\n\nAgile thinker passionate in Android Development, he creates and maintains some FOSS tools to improve productivity.\n\nTalk to him about Kotlin, Clean Code, or Free Software and you will see his eyes light up.",
            "imageUrl": "src/img/people/gautier-mechling.png",
            "sessions": [
                1
            ]
        },
        {
            "id": 3,
            "firstName": "Sasa",
            "lastName": "Sekulic",
            "websiteTitle": "Entrepreneur and Android developer",
            "bio": "Co-founder of the Alter Ego Mobile Solutions and Android developer for the past 5 years, I have been working for companies like the United Nations, Telecom Italia and working on projects like the Sochi Winter Olympics app. I got bitten by the reactive programming bug a while ago and I am currently writing a book for Manning Publishing about it with other 2 colleagues. ",
            "imageUrl": "src/img/people/sasa-sekulic.png",
            "sessions": [
                2
            ]
        },
        {
            "id": 4,
            "firstName": "Said",
            "lastName": "Tahsin Dane",
            "websiteTitle": "Google Developers Expert on Android",
            "bio": "Said is a Google Developers Expert on Android. He has been an Android Developer since Cupcake with apps for Android, Google Glass, Android Wear. He is a very passionate developer who tries to live on the bleeding edge of technology and is very interested in mobile UX.\n\nHe is also an active member and organizer at GDG Istanbul enjoying organizing various conferences and hackathons. In addition, he is part of GDG[X] - a GDG related open-source organization.",
            "imageUrl": "src/img/people/said-tahsin-dane.png",
            "sessions": [
                2
            ]
        },
        {
            "id": 5,
            "firstName": "Anton",
            "lastName": "Rutkevich",
            "websiteTitle": "Software engineer at JunoLab",
            "bio": "Anton is a software engineer at JunoLab. While focusing mostly on Android development, he is also passionate about alternative JVM-based languages, Kotlin and Groovy especially.\n\nHis other professional interests include continuous integration (\"One Button to rule them all\") and game development. Anton is a co-organizer of Google Developers Group Minsk and an active speaker at mobile and Java csaonferences.",
            "imageUrl": "src/img/people/anton-rutkevich.jpg",
            "sessions": [
                2
            ]
        },
        {
            "id": 6,
            "firstName": "Shintaro",
            "lastName": "Katafuchi",
            "websiteTitle": "A Tokyo based Android developer.",
            "bio": "A Tokyo based Android developer.\n\nI'm working at Recruit Technologies Co.,Ltd and developing Android app/server side Java.\nAnd I'm one of the member of DroidKaigi, the biggest Android conference in Tokyo.",
            "imageUrl": "src/img/people/shintaro-katafuchi.png",
            "sessions": [
                2
            ]
        },
        {
            "id": 7,
            "firstName": "Magdalena",
            "lastName": "Zadara",
            "websiteTitle": "UI Designer @ Polidea",
            "bio": "Magda studied product design at Central Saint Martins and the Academy of Fine Arts in Warsaw and decided to mix her passion for technology with the traditional craft she learned to work on digital products. Currently, she works as a UI Designer at Polidea, where she’s part of mixed developer-designer teams who create mobile apps. She also runs the Design Practice Meetup and is one of the organisers of MCE Conferences.",
            "imageUrl": "src/img/people/magdalena-zadara.jpg",
            "sessions": [
                2
            ]
        },
        {
            "id": 8,
            "firstName": "Konrad",
            "lastName": "Krakowiak",
            "websiteTitle": "Senior Software Engineer @ Polidea",
            "bio": "Almost 6 years of experience in programming, 5 of which as an Android developer. I participated in many business projects and I eagerly share my knowledge with other people. Currently I am Senior android engineer @Polidea.\n\nProgramming is not only a job, it is my passion and hobby... Nothing more, nothing less about me :)",
            "imageUrl": "src/img/people/konrad-krakowiak.jpg",
            "sessions": [
                2
            ]
        }
    ]
}
